package mj;

public class TestWolong {

	
	public static void printAllPaiGroup(){
		String[] numNames = {
				"一", "二","三","四","五",
				"六", "七","八","九","十",
				"十一", "十二","十三","十四","十五",
				"十六", "十七","十八","十九","二十"};
		String[] cardNames = {
				"3","4","5","6","7","8","9","10","J","Q","K","A","2",
		};
		StringBuilder sb = new StringBuilder();
		for(String numName : numNames){
			for(String cardName : cardNames){
				sb.append(numName).append(cardName).append(" < ");
			}
		}
		System.out.println(sb.toString());
	}
	/**
	 * @param args
	 */
	public static void main(String[] args) {

		//printAllPaiGroup();
		String str = " 一3 < 一4 < 一5 < 一6 < 一7 < 一8 < 一9 < 一10 < 一J < 一Q < 一K < 一A < 一2 < 小王 < 大王 < 二3 < 二4 < 二5 < 二6 < 二7 < 二8 < 二9 < 二10 < 二J < 二Q < 二K < 二A < 二2 < 二王 < 三3 < 三4 < 三5 < 三6 < 三7 < 三8 < 三9 < 三10 < 三J < 三Q < 三K < 三A < 三2 < 四3 < 四4 < 四5 < 四6 < 四7 < 四8 < 四9 < 四10 < 四J < 四Q < 四K < 四A < 四2 < 五3 < 五4 < 五5 < 五6 < 五7 < 五8 < 五9 < 五10 < 五J < 五Q < 五K < 五A < 五2 < 三异王 < 六3 < 六4 < 六5 < 六6 < 六7 < 六8 < 六9 < 六10 < 六J < 六Q < 六K < 六A < 六2 < 三同王 < 七3 < 七4 < 七5 < 七6 < 七7 < 七8 < 七9 < 七10 < 七J < 七Q < 七K < 七A < 七2 < 四异王 < 八3 < 八4 < 八5 < 八6 < 八7 < 八8 < 八9 < 八10 < 八J < 八Q < 八K < 八A < 八2 < 四同王 < 九3 < 九4 < 九5 < 九6 < 九7 < 九8 < 九9 < 九10 < 九J < 九Q < 九K < 九A < 九2 < 五异王 < 十3 < 十4 < 十5 < 十6 < 十7 < 十8 < 十9 < 十10 < 十J < 十Q < 十K < 十A < 十2 < 五同王 < 十一3 < 十一4 < 十一5 < 十一6 < 十一7 < 十一8 < 十一9 < 十一10 < 十一J < 十一Q < 十一K < 十一A < 十一2 < 六异王 < 十二3 < 十二4 < 十二5 < 十二6 < 十二7 < 十二8 < 十二9 < 十二10 < 十二J < 十二Q < 十二K < 十二A < 十二2 < 六同王 < 十三3 < 十三4 < 十三5 < 十三6 < 十三7 < 十三8 < 十三9 < 十三10 < 十三J < 十三Q < 十三K < 十三A < 十三2 < 七异王 < 十四3 < 十四4 < 十四5 < 十四6 < 十四7 < 十四8 < 十四9 < 十四10 < 十四J < 十四Q < 十四K < 十四A < 十四2 < 十五3 < 十五4 < 十五5 < 十五6 < 十五7 < 十五8 < 十五9 < 十五10 < 十五J < 十五Q < 十五K < 十五A < 十五2 < 八异王 < 十六3 < 十六4 < 十六5 < 十六6 < 十六7 < 十六8 < 十六9 < 十六10 < 十六J < 十六Q < 十六K < 十六A < 十六2 < 十七3 < 十七4 < 十七5 < 十七6 < 十七7 < 十七8 < 十七9 < 十七10 < 十七J < 十七Q < 十七K < 十七A < 十七2 < 九异王 < 十八3 < 十八4 < 十八5 < 十八6 < 十八7 < 十八8 < 十八9 < 十八10 < 十八J < 十八Q < 十八K < 十八A < 十八2 < 十九3 < 十九4 < 十九5 < 十九6 < 十九7 < 十九8 < 十九9 < 十九10 < 十九J < 十九Q < 十九K < 十九A < 十九2 < 十异王 < 二十3 < 二十4 < 二十5 < 二十6 < 二十7 < 二十8 < 二十9 < 二十10 < 二十J < 二十Q < 二十K < 二十A < 二十2 < 二一5 < 二一10 < 二一K < 十一异王 < 二二5 < 二二10 < 二二K < 二三5 < 二三10 < 二三K < 十二异王 < 二四5 < 二四10 < 二四K";
		String[] strs = str.split("<");
		int count = 0;
		for(String cardName : strs){
			if(cardName.trim().length() > 0) {
				System.out.println(cardName);
				++count;
			}
		}
		System.out.println(count);

	}

}
